Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
infra-flash-commit:b6b1390 


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.http.casdoor_oidc_discovery[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "casdoor_oidc_discovery" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + request_headers      = {
          + "Accept" = "application/json"
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://sso.zitian.party/.well-known/openid-configuration"
    }

  # random_id.kubero_session_secret will be destroyed
  # (because random_id.kubero_session_secret is not in configuration)
- resource "random_id" "kubero_session_secret" {
      - b64_std     = "zeyCGHUvA37amm8E6hBavxw1k+T73Gv83nhjVj8AhKc=" -> null
      - b64_url     = "zeyCGHUvA37amm8E6hBavxw1k-T73Gv83nhjVj8AhKc" -> null
      - byte_length = 32 -> null
      - dec         = "93142007753261989524079635343112339598131496040344497494482953907607187784871" -> null
      - hex         = "cdec8218752f037eda9a6f04ea105abf1c3593e4fbdc6bfcde7863563f0084a7" -> null
      - id          = "zeyCGHUvA37amm8E6hBavxw1k-T73Gv83nhjVj8AhKc" -> null
    }

  # random_id.kubero_webhook_secret will be destroyed
  # (because random_id.kubero_webhook_secret is not in configuration)
- resource "random_id" "kubero_webhook_secret" {
      - b64_std     = "dhHyw/8bNByDLHGDFFTJ8TbDQlIu+RYg9XSKtAo5dBI=" -> null
      - b64_url     = "dhHyw_8bNByDLHGDFFTJ8TbDQlIu-RYg9XSKtAo5dBI" -> null
      - byte_length = 32 -> null
      - dec         = "53404628039598015043464004424300791930473252391680527436579453106795574817810" -> null
      - hex         = "7611f2c3ff1b341c832c71831454c9f136c342522ef91620f5748ab40a397412" -> null
      - id          = "dhHyw_8bNByDLHGDFFTJ8TbDQlIu-RYg9XSKtAo5dBI" -> null
    }

  # restapi_object.app_dashboard_oidc[0] will be created
+ resource "restapi_object" "app_dashboard_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin/"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_kubero_oidc[0] will be created
+ resource "restapi_object" "app_kubero_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin/"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_portal_gate[0] will be created
+ resource "restapi_object" "app_portal_gate" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin/"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_vault_oidc[0] will be created
+ resource "restapi_object" "app_vault_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin/"
      + update_path     = "/api/update-application"
    }

  # restapi_object.provider_github[0] will be created
+ resource "restapi_object" "provider_github" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-provider"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-provider"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-provider"
      + read_path       = "/api/get-provider?id=admin/"
      + update_path     = "/api/update-provider"
    }

  # vault_auth_backend.kubernetes will be destroyed
  # (because vault_auth_backend.kubernetes is not in configuration)
- resource "vault_auth_backend" "kubernetes" {
      - accessor        = "auth_kubernetes_38918ebe" -> null
      - disable_remount = false -> null
      - id              = "kubernetes" -> null
      - local           = false -> null
      - path            = "kubernetes" -> null
      - tune            = [] -> null
      - type            = "kubernetes" -> null
    }

  # vault_jwt_auth_backend.oidc[0] will be created
+ resource "vault_jwt_auth_backend" "oidc" {
      + accessor           = (known after apply)
      + description        = "OIDC backend for Casdoor"
      + disable_remount    = false
      + id                 = (known after apply)
      + local              = false
      + namespace_in_state = true
      + oidc_client_id     = "vault-oidc"
      + oidc_client_secret = (sensitive value)
      + oidc_discovery_url = "https://sso.zitian.party"
      + path               = "oidc"
      + tune               = [
          + {
              + allowed_response_headers     = []
              + audit_non_hmac_request_keys  = []
              + audit_non_hmac_response_keys = []
              + default_lease_ttl            = "1h"
              + listing_visibility           = ""
              + max_lease_ttl                = "8h"
              + passthrough_request_headers  = []
              + token_type                   = "default-service"
            },
        ]
      + type               = "oidc"
    }

  # vault_jwt_auth_backend_role.reader[0] will be created
+ resource "vault_jwt_auth_backend_role" "reader" {
      + allowed_redirect_uris        = [
          + "http://localhost:8250/oidc/callback",
          + "https://secrets.zitian.party/ui/vault/auth/oidc/oidc/callback",
        ]
      + backend                      = "oidc"
      + bound_audiences              = [
          + "vault-oidc",
        ]
      + bound_claims_type            = (known after apply)
      + clock_skew_leeway            = 0
      + disable_bound_claims_parsing = false
      + expiration_leeway            = 0
      + id                           = (known after apply)
      + not_before_leeway            = 0
      + oidc_scopes                  = [
          + "email",
          + "openid",
          + "profile",
        ]
      + role_name                    = "reader"
      + role_type                    = "oidc"
      + token_policies               = [
          + "reader",
        ]
      + token_ttl                    = 3600
      + token_type                   = "default"
      + user_claim                   = "sub"
      + user_claim_json_pointer      = false
      + verbose_oidc_logging         = true
    }

  # vault_kubernetes_auth_backend_config.config will be destroyed
  # (because vault_kubernetes_auth_backend_config.config is not in configuration)
- resource "vault_kubernetes_auth_backend_config" "config" {
      - backend                           = "kubernetes" -> null
      - disable_iss_validation            = true -> null
      - disable_local_ca_jwt              = false -> null
      - id                                = "auth/kubernetes/config" -> null
      - kubernetes_host                   = "https://kubernetes.default.svc" -> null
      - pem_keys                          = [] -> null
      - use_annotations_as_alias_metadata = false -> null
    }

  # vault_kubernetes_auth_backend_role.kubero will be destroyed
  # (because vault_kubernetes_auth_backend_role.kubero is not in configuration)
- resource "vault_kubernetes_auth_backend_role" "kubero" {
      - alias_name_source                = "serviceaccount_uid" -> null
      - backend                          = "kubernetes" -> null
      - bound_service_account_names      = [
          - "kubero",
        ] -> null
      - bound_service_account_namespaces = [
          - "kubero-*",
        ] -> null
      - id                               = "auth/kubernetes/role/kubero" -> null
      - role_name                        = "kubero" -> null
      - token_bound_cidrs                = [] -> null
      - token_explicit_max_ttl           = 0 -> null
      - token_max_ttl                    = 0 -> null
      - token_no_default_policy          = false -> null
      - token_num_uses                   = 0 -> null
      - token_period                     = 0 -> null
      - token_policies                   = [
          - "kubero",
        ] -> null
      - token_ttl                        = 3600 -> null
      - token_type                       = "default" -> null
    }

  # vault_kv_secret_v2.kubero will be destroyed
  # (because vault_kv_secret_v2.kubero is not in configuration)
- resource "vault_kv_secret_v2" "kubero" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = true -> null
      - disable_read        = false -> null
      - id                  = "secret/data/data/kubero" -> null
      - metadata            = {
          - "created_time"    = "2025-12-18T20:45:39.803369447Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = ""
          - "destroyed"       = "false"
          - "version"         = "1"
        } -> null
      - mount               = "secret" -> null
      - name                = "data/kubero" -> null
      - path                = "secret/data/data/kubero" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # vault_policy.kubero will be destroyed
  # (because vault_policy.kubero is not in configuration)
- resource "vault_policy" "kubero" {
      - id     = "kubero" -> null
      - name   = "kubero" -> null
      - policy = <<-EOT
            path "secret/data/data/kubero" {
              capabilities = ["read"]
            }
        EOT -> null
    }

Plan: 7 to add, 0 to change, 7 to destroy.

Changes to Outputs:
~ sso_e2e_status                 = {
      ~ oidc_discovery = "disabled" -> (known after apply)
      ~ portal_auth    = "disabled" -> "200"
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 7 to add, 0 to change, 7 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`